EternityFOR/Self_Balance_Car/Self_Balance_Car_STM32F103RET6/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <string.h>
#include <math.h>
#include "stm32f1xx_hal_flash.h"
//Gyro
#include "Gyro.h"
//Motor
#include "Motor.h"
//Encoder
#include "Encoder.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DAC_HandleTypeDef hdac;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;

UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;

/* Definitions for msg_rx_t */
osThreadId_t msg_rx_tHandle;
const osThreadAttr_t msg_rx_t_attributes = {
  .name = "msg_rx_t",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for Motor_update_t */
osThreadId_t Motor_update_tHandle;
const osThreadAttr_t Motor_update_t_attributes = {
  .name = "Motor_update_t",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for msg_rx_q */
osMessageQueueId_t msg_rx_qHandle;
const osMessageQueueAttr_t msg_rx_q_attributes = {
  .name = "msg_rx_q"
};
/* USER CODE BEGIN PV */
//Car_ctr&setup_data
#define FLASH_PID_PARAMS_ADDRESS 0x0800ff00
#define RX_BUFFER_SIZE_1 150
uint8_t rxBuffer_1[RX_BUFFER_SIZE_1];
uint8_t rxIndex_1 = 0;
uint8_t rxData_1;
//#define RX_BUFFER_SIZE_2 64
//uint8_t rxBuffer_2[RX_BUFFER_SIZE_2];
//uint8_t rxIndex_2 = 0;
//uint8_t rxData_2;
typedef enum {
    DataType_Control,
    DataType_Weather,
    DataType_PID,
    DataType_Mode_Control,
    DataType_Unknown // Useful for error handling
} DataType;
typedef struct {
    DataType type;
    uint8_t msg_Data[RX_BUFFER_SIZE_1];
    int L; // Left wheel speed
    int R; // Right wheel speed
    int A; // Additional action or mode

    struct {
        float Balance_Kp, Balance_Ki, Balance_Kd; // Balance PID
        float Velocity_Kp, Velocity_Ki, Velocity_Kd; // Velocity PID
    } PID;

    struct {
        char weather[32]; // Description of the weather
        int temperature; // Temperature
        char date[16]; // Date in YYYY-MM-DD format
        char time[16]; // Time HH:MM format
    } WeatherData;
} msg_data_t;
MotorControl motor_R, motor_L;
float Balance_Kp, Balance_Ki, Balance_Kd;
float Velocity_Kp, Velocity_Ki, Velocity_Kd;
#define DEFAULT_BALANCE_KP 263.0f
#define DEFAULT_BALANCE_KI 0.0f
#define DEFAULT_BALANCE_KD 0.4f
#define DEFAULT_VELOCITY_KP 0.6f
#define DEFAULT_VELOCITY_KI 0.0025f
#define DEFAULT_VELOCITY_KD 0.0f
uint8_t ctr_cmd;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM8_Init(void);
static void MX_I2C2_Init(void);
static void MX_TIM5_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_DAC_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI2_Init(void);
void msg_rx(void *argument);
void Motor_update(void *argument);

/* USER CODE BEGIN PFP */
int _write(int file , char *ptr,int len)
{
    int i = 0;
    for(i = 0;i<len;i++)
        ITM_SendChar((*ptr++));
    return len;
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void Timer_Start(void)
{
// ***** CN2 CN4 *****
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_2);
	HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_1);
	HAL_TIM_Encoder_Start(&htim3, TIM_CHANNEL_2);
	HAL_TIM_Encoder_Start(&htim5, TIM_CHANNEL_1);
	HAL_TIM_Encoder_Start(&htim5, TIM_CHANNEL_2);

// ***** CN1 CN3 *****
//	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
//	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
//	  HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_3);
//	  HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_4);
//	  HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_1);
//	  HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_2);
//	  HAL_TIM_Encoder_Start(&htim4, TIM_CHANNEL_1);
//	  HAL_TIM_Encoder_Start(&htim4, TIM_CHANNEL_2);
}
int is_nan(float value) {
    // Check standard isnan
    if (isnan(value)) return 1;

    // Additional check for NaN representation using union
    union {
        float f;
        uint32_t u;
    } converter;

