EternityFOR/Self_Balance_Car/Self_Balance_Car_STM32F103RET6/Core/Src/main.c
}

/**
  * Enable DMA controller clock
  */
static void MX_DMA_Init(void)
{

  /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();

  /* DMA interrupt init */
  /* DMA1_Channel6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);
  /* DMA1_Channel7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
/* USER CODE BEGIN MX_GPIO_Init_1 */
/* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(Running_Mode_GPIO_Port, Running_Mode_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(Charging_Mode_GPIO_Port, Charging_Mode_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin : Running_Mode_Pin */
  GPIO_InitStruct.Pin = Running_Mode_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(Running_Mode_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : Mode_Detection_Pin */
  GPIO_InitStruct.Pin = Mode_Detection_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(Mode_Detection_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : Charging_Mode_Pin */
  GPIO_InitStruct.Pin = Charging_Mode_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(Charging_Mode_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
//Uart Callback

HAL_StatusTypeDef WritePIDParamsToFlash(float Balance_Kp, float Balance_Ki, float Balance_Kd, float Velocity_Kp, float Velocity_Ki, float Velocity_Kd) {
    HAL_StatusTypeDef status;
    uint32_t data[6];
    uint32_t address = FLASH_PID_PARAMS_ADDRESS;

    memcpy(&data[0], &Balance_Kp, sizeof(float));
    memcpy(&data[1], &Balance_Ki, sizeof(float));
    memcpy(&data[2], &Balance_Kd, sizeof(float));
    memcpy(&data[3], &Velocity_Kp, sizeof(float));
    memcpy(&data[4], &Velocity_Ki, sizeof(float));
    memcpy(&data[5], &Velocity_Kd, sizeof(float));

    //FLASH_Unlock
    HAL_FLASH_Unlock();

    FLASH_EraseInitTypeDef eraseInitStruct;
    uint32_t SectorError;
    eraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
    eraseInitStruct.PageAddress = FLASH_PID_PARAMS_ADDRESS;
    eraseInitStruct.NbPages = 1;
    status = HAL_FLASHEx_Erase(&eraseInitStruct, &SectorError);
    if (status != HAL_OK) {
        HAL_FLASH_Lock();
        return status;
    }

    /* Write the PID parameters to flash, word by word (32 bits) */
    for (uint32_t i = 0; i < (sizeof(data) / sizeof(uint32_t)); i++) {
        status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, data[i]);
        if (status != HAL_OK) {
            break;
        }
        address += 4;
    }
    //FLASH_Lock
    HAL_FLASH_Lock();

    return status;
}

void ReadPIDParamsFromFlash(float *Balance_Kp, float *Balance_Ki, float *Balance_Kd, float *Velocity_Kp, float *Velocity_Ki, float *Velocity_Kd) {
    memcpy(Balance_Kp, (float*)FLASH_PID_PARAMS_ADDRESS, sizeof(float));
    memcpy(Balance_Ki, (float*)(FLASH_PID_PARAMS_ADDRESS + 4), sizeof(float));
    memcpy(Balance_Kd, (float*)(FLASH_PID_PARAMS_ADDRESS + 8), sizeof(float));
    memcpy(Velocity_Kp, (float*)(FLASH_PID_PARAMS_ADDRESS + 12), sizeof(float));
    memcpy(Velocity_Ki, (float*)(FLASH_PID_PARAMS_ADDRESS + 16), sizeof(float));
    memcpy(Velocity_Kd, (float*)(FLASH_PID_PARAMS_ADDRESS + 20), sizeof(float));

    // Check for NaN values and set to default if necessary
    if (is_nan(*Balance_Kp)) *Balance_Kp = DEFAULT_BALANCE_KP;
    if (is_nan(*Balance_Ki)) *Balance_Ki = DEFAULT_BALANCE_KI;
    if (is_nan(*Balance_Kd)) *Balance_Kd = DEFAULT_BALANCE_KD;
    if (is_nan(*Velocity_Kp)) *Velocity_Kp = DEFAULT_VELOCITY_KP;
    if (is_nan(*Velocity_Ki)) *Velocity_Ki = DEFAULT_VELOCITY_KI;
    if (is_nan(*Velocity_Kd)) *Velocity_Kd = DEFAULT_VELOCITY_KD;
}

void UART_IRQHandler_IDLE(UART_HandleTypeDef *huart)
{
	msg_data_t ctr;
	if(huart == &huart2)
	{
		if(__HAL_UART_GET_FLAG(huart, UART_FLAG_IDLE) != RESET)
		{
			HAL_UART_DMAStop(&huart2);
			__HAL_UART_CLEAR_IDLEFLAG(&huart2);
			__HAL_UART_CLEAR_OREFLAG(&huart2);
			memcpy(ctr.msg_Data ,rxBuffer_1, sizeof(rxBuffer_1));
			osStatus_t status = osMessageQueuePut(msg_rx_qHandle, &ctr, 0, 0);
			if (status != osOK) {printf("Failed to put message into queue\n");}
			HAL_UART_Receive_DMA(&huart2, rxBuffer_1, sizeof(rxBuffer_1));
		}
	}
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_msg_rx */
/**
  * @brief  Function implementing the msg_rx_t thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_msg_rx */
void msg_rx(void *argument)
{
  /* USER CODE BEGIN 5 */
	msg_data_t ctr;
	char type[32];
	for(;;) {
		if (osMessageQueueGet(msg_rx_qHandle, &ctr, NULL, osWaitForever) == osOK) {
			printf("%s\n",ctr.msg_Data);
			if (sscanf((char*)ctr.msg_Data, "{\"Type\":\"%[^\"]\"", type) == 1) {
				if (strcmp(type, "Control") == 0) {
					if (sscanf((char*)ctr.msg_Data, "{\"Type\":\"Control\",\"L\":%d,\"R\":%d,\"A\":%d}",
							   &ctr.L, &ctr.R, &ctr.A) == 3) {
						motor_R.targetSpeed = ctr.R;
						motor_L.targetSpeed = ctr.L;
						ctr_cmd = ctr.A;
						ctr.type = DataType_Control;
					}
				}
				else if (strcmp(type, "Weather") == 0) {
					if (sscanf((char*)ctr.msg_Data, "{\"Type\":\"Weather\",\"Weather\":\"%[^\"]\",\"Temperature\":%d,\"Date\":\"%[^\"]\",\"Time\":\"%[^\"]\"}",
							   ctr.WeatherData.weather,
							   &ctr.WeatherData.temperature,
							   ctr.WeatherData.date,
							   ctr.WeatherData.time) == 4) {
						printf("Weather: %s, Temp: %d, Date: %s, Time: %s\n",
							   ctr.WeatherData.weather,
							   ctr.WeatherData.temperature,
							   ctr.WeatherData.date,
							   ctr.WeatherData.time);
						ctr.type = DataType_Weather;
					}
				} else if (strcmp(type, "PID") == 0) {
					if (sscanf((char*)ctr.msg_Data, "{\"Type\":\"PID\",\"Balance_Kp\":%f,\"Balance_Ki\":%f,\"Balance_Kd\":%f,\"Velocity_Kp\":%f,\"Velocity_Ki\":%f,\"Velocity_Kd\":%f}",
							   &ctr.PID.Balance_Kp,
							   &ctr.PID.Balance_Ki,
							   &ctr.PID.Balance_Kd,
							   &ctr.PID.Velocity_Kp,
							   &ctr.PID.Velocity_Ki,
							   &ctr.PID.Velocity_Kd) == 6) {
						Balance_Kp = ctr.PID.Balance_Kp;
						Balance_Ki = ctr.PID.Balance_Ki;
						Balance_Kd = ctr.PID.Balance_Kd;
						Velocity_Kp = ctr.PID.Velocity_Kp;
						Velocity_Ki = ctr.PID.Velocity_Ki;
						Velocity_Kd = ctr.PID.Velocity_Kd;
						ctr.type = DataType_PID;
						if (WritePIDParamsToFlash(Balance_Kp, Balance_Ki, Balance_Kd, Velocity_Kp, Velocity_Ki, Velocity_Kd) != HAL_OK) {
							printf("PID_store_to_flash_failed\n");
						}
					}
				}
				else if (strcmp(type, "Mode_Control") == 0) {
					printf("Mode control switch\n");
					ctr.type = DataType_Mode_Control;
				} else {
					printf("Unknown message type\n");
					ctr.type = DataType_Unknown;
				}
			}
		}
		osDelay(1);
	}
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_Motor_update */
/**
* @brief Function implementing the Motor_update_t thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_Motor_update */
void Motor_update(void *argument)
{
  /* USER CODE BEGIN Motor_update */
	  int count = 1;

