EternityFOR/Self_Balance_Car/Self_Balance_Car_STM32F103RET6/Core/Src/main.c
	  /* Infinite loop */
	  for(;;)
	  {
		  read_angle(&motor_R, &motor_L);
		  if (count % 10 == 0) {
			Velocity_PID_Control(&motor_R, &motor_L);
		  }

		  Balance_PID_Control(&motor_R, &motor_L);

		  if (HAL_GPIO_ReadPin(GPIOC, Mode_Detection_Pin) == GPIO_PIN_RESET) {
			UpdateMotorPWM(&motor_R, &motor_L);
		  }

		  osDelay(5);
		  count = (count ) % 10 == 0 ? 1: count+1;
	  }
  /* USER CODE END Motor_update */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
